WenZhimo/Embedded-STM32/23FreeRTOS/05BinarySemaphore/Core/Src/freertos.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File Name          : freertos.c
  * Description        : Code for freertos applications
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "FreeRTOS.h"
#include "portmacro.h"
#include "stm32f4xx_hal.h"
#include "task.h"
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "../../ThirdParty/MyLib/myinclude.h"
#include "rtc.h"
#include "semphr.h"
#include <stdio.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN Variables */
uint32_t adc_value = 0;
/* USER CODE END Variables */
/* Definitions for Task_SYS_INIT */
osThreadId_t Task_SYS_INITHandle;
const osThreadAttr_t Task_SYS_INIT_attributes = {
  .name = "Task_SYS_INIT",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityRealtime,
};
/* Definitions for Task_showADC */
osThreadId_t Task_showADCHandle;
const osThreadAttr_t Task_showADC_attributes = {
  .name = "Task_showADC",
  .stack_size = 200 * 4,
  .priority = (osPriority_t) osPriorityLow,
};
/* Definitions for Task_CheckIn */
osThreadId_t Task_CheckInHandle;
const osThreadAttr_t Task_CheckIn_attributes = {
  .name = "Task_CheckIn",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityLow,
};
/* Definitions for Task_Middle */
osThreadId_t Task_MiddleHandle;
const osThreadAttr_t Task_Middle_attributes = {
  .name = "Task_Middle",
  .stack_size = 128 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for Task_Low */
osThreadId_t Task_LowHandle;
const osThreadAttr_t Task_Low_attributes = {
  .name = "Task_Low",
  .stack_size = 128 * 4,
  .priority = (osPriority_t) osPriorityLow,
};
/* Definitions for Task_High */
osThreadId_t Task_HighHandle;
const osThreadAttr_t Task_High_attributes = {
  .name = "Task_High",
  .stack_size = 128 * 4,
  .priority = (osPriority_t) osPriorityHigh,
};
/* Definitions for BinarySem_DataReady */
osSemaphoreId_t BinarySem_DataReadyHandle;
const osSemaphoreAttr_t BinarySem_DataReady_attributes = {
  .name = "BinarySem_DataReady"
};
/* Definitions for token */
osSemaphoreId_t tokenHandle;
const osSemaphoreAttr_t token_attributes = {
  .name = "token"
};
/* Definitions for CountingSem_Table */
osSemaphoreId_t CountingSem_TableHandle;
const osSemaphoreAttr_t CountingSem_Table_attributes = {
  .name = "CountingSem_Table"
};

/* Private function prototypes -----------------------------------------------*/
/* USER CODE BEGIN FunctionPrototypes */

/* USER CODE END FunctionPrototypes */

void AppTask_SYS_INIT(void *argument);
void App_Task_showADC(void *argument);
void App_Task_CheckIn(void *argument);
void App_Task_Middle(void *argument);
void App_Task_Low(void *argument);
void App_Task_High(void *argument);

void MX_FREERTOS_Init(void); /* (MISRA C 2004 rule 8.1) */

/* Hook prototypes */
void configureTimerForRunTimeStats(void);
unsigned long getRunTimeCounterValue(void);

/* USER CODE BEGIN 1 */
/* Functions needed when configGENERATE_RUN_TIME_STATS is on */
__weak void configureTimerForRunTimeStats(void)
{

}

__weak unsigned long getRunTimeCounterValue(void)
{
return 0;
}
/* USER CODE END 1 */

/**
  * @brief  FreeRTOS initialization
  * @param  None
  * @retval None
  */
void MX_FREERTOS_Init(void) {
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* Create the semaphores(s) */
  /* creation of BinarySem_DataReady */
  BinarySem_DataReadyHandle = osSemaphoreNew(1, 0, &BinarySem_DataReady_attributes);

  /* creation of token */
  tokenHandle = osSemaphoreNew(1, 1, &token_attributes);

  /* creation of CountingSem_Table */
  CountingSem_TableHandle = osSemaphoreNew(5, 5, &CountingSem_Table_attributes);

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* creation of Task_SYS_INIT */
  Task_SYS_INITHandle = osThreadNew(AppTask_SYS_INIT, NULL, &Task_SYS_INIT_attributes);

  /* creation of Task_showADC */
  Task_showADCHandle = osThreadNew(App_Task_showADC, NULL, &Task_showADC_attributes);

  /* creation of Task_CheckIn */
  Task_CheckInHandle = osThreadNew(App_Task_CheckIn, NULL, &Task_CheckIn_attributes);

  /* creation of Task_Middle */
  Task_MiddleHandle = osThreadNew(App_Task_Middle, NULL, &Task_Middle_attributes);

  /* creation of Task_Low */
  Task_LowHandle = osThreadNew(App_Task_Low, NULL, &Task_Low_attributes);

  /* creation of Task_High */
  Task_HighHandle = osThreadNew(App_Task_High, NULL, &Task_High_attributes);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_EVENTS */
  /* add events, ... */
  /* USER CODE END RTOS_EVENTS */

}

/* USER CODE BEGIN Header_AppTask_SYS_INIT */
/**
  * @brief  Function implementing the Task_SYS_INIT thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_AppTask_SYS_INIT */
void AppTask_SYS_INIT(void *argument)
{
  /* USER CODE BEGIN AppTask_SYS_INIT */
  /* Infinite loop */
  for(;;)
  {
    SD_Mount_StateMachine();
    if(SD_Is_Mounted() == 1){
      //printf("SD Card Mounted Successfully!\r\n");
      
      lcd_dma2d_show_eubf_str(0, 32, (char*)"互斥量实验", "ZCOOL QingKe HuangYou", 25, WHITE);
      lcd_dma2d_update_screen();
      vTaskDelete(NULL);
    }
    //osDelay(1);
  }
  /* USER CODE END AppTask_SYS_INIT */
}

/* USER CODE BEGIN Header_App_Task_showADC */
/**
* @brief Function implementing the Task_showADC thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_App_Task_showADC */
void App_Task_showADC(void *argument)
{
  /* USER CODE BEGIN App_Task_showADC */
  /* Infinite loop */
  for(;;)
  {
    // 等待数据准备就绪
    if(xSemaphoreTake(BinarySem_DataReadyHandle, portMAX_DELAY) == pdTRUE){
      // 数据已准备好，继续执行
      // 显示ADC值
      char adc_str[16];
      // 格式化输出，保留4位
      snprintf(adc_str, sizeof(adc_str), "%04lu", adc_value);
      lcd_dma2d_show_eubf_str(0, 64,(char*)"ADC Value:", "ZCOOL QingKe HuangYou", 32, WHITE);
      lcd_dma2d_fill(0, 64, 160, 98, BLACK);
      lcd_dma2d_show_eubf_str(0, 96,(char*)adc_str, "ZCOOL QingKe HuangYou", 32, WHITE);
      lcd_dma2d_update_screen();
      osDelay(1);
    }
    else{
      // 数据未准备好，等待
    }
    osDelay(250);
    
  }
  /* USER CODE END App_Task_showADC */
}

/* USER CODE BEGIN Header_App_Task_CheckIn */
/**
* @brief Function implementing the Task_CheckIn thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_App_Task_CheckIn */
void App_Task_CheckIn(void *argument)
{
  /* USER CODE BEGIN App_Task_CheckIn */
  char temp_str[30];
  UBaseType_t last_count = 0xFFFFFFFF; 
  UBaseType_t current_count = 0;

  osDelay(1500); 

  sprintf(temp_str, "%lu", uxSemaphoreGetCount(CountingSem_TableHandle));
  
  // 第一行：Y=32 (0~32)
  lcd_dma2d_show_eubf_str(160, 32, (char*)"TOTAL_TABLE:", "ZCOOL QingKe HuangYou", 25, WHITE);
  // 第二行：Y=64 (32~64)
  lcd_dma2d_show_eubf_str(160, 64, temp_str, "ZCOOL QingKe HuangYou", 32, WHITE);
  // 第三行：Y=96 (64~96)
  lcd_dma2d_show_eubf_str(160, 96, (char*)"AVAILABLE:", "ZCOOL QingKe HuangYou", 32, WHITE);
  
  // 第一次推送到屏幕
  lcd_dma2d_update_screen();

  /* Infinite loop */
  for(;;)
  {
    // 按键处理
    if(myGetKeyPressStateByID(KEY_UP)){
      // 清除第五行 (占据 128~160)
      lcd_dma2d_fill(160, 128, 320, 160+1, BLACK); 
      
      if(xSemaphoreTake(CountingSem_TableHandle, 100) == pdTRUE){
        lcd_dma2d_show_eubf_str(160, 160, (char*)"CheckIn OK", "ZCOOL QingKe HuangYou", 25, GREEN);
      } else {
        lcd_dma2d_show_eubf_str(160, 160, (char*)"CheckIn Failed", "ZCOOL QingKe HuangYou", 25, RED);
      }
      lcd_dma2d_update_screen();
    }

    // 按需刷新
    current_count = uxSemaphoreGetCount(CountingSem_TableHandle);
    if(current_count != last_count)
    {
      sprintf(temp_str, "%lu", (unsigned long)current_count);
      
      // 清除第四行 (占据 96~128)
      lcd_dma2d_fill(160, 96, 320, 128+1, BLACK); 
      // 绘制第四行数字
      lcd_dma2d_show_eubf_str(160, 128, temp_str, "ZCOOL QingKe HuangYou", 32, WHITE);
      
      lcd_dma2d_update_screen();
      last_count = current_count;
    }
    
    osDelay(100);
  }
  /* USER CODE END App_Task_CheckIn */
}

/* USER CODE BEGIN Header_App_Task_Middle */
/**
* @brief Function implementing the Task_Middle thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_App_Task_Middle */
void App_Task_Middle(void *argument)
{
  /* USER CODE BEGIN App_Task_Middle */
  /* Infinite loop */
  for(;;)
  {
    printf("MIDDLE IS RUNING...\r\n");
    HAL_Delay(10);
    osDelay(500);
  }
  /* USER CODE END App_Task_Middle */
}

/* USER CODE BEGIN Header_App_Task_Low */
/**
* @brief Function implementing the Task_Low thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_App_Task_Low */
void App_Task_Low(void *argument)
{
  /* USER CODE BEGIN App_Task_Low */
  /* Infinite loop */
  for(;;)
  {
    if(xSemaphoreTake(tokenHandle,pdMS_TO_TICKS(300)) == pdTRUE){
      // 成功获取到 token，执行临界区代码
      printf("LOW TAKE IT!\r\n");
      HAL_Delay(1000);
      printf("LOW GIVE IT!\r\n");
      HAL_Delay(10);
      xSemaphoreGive(tokenHandle); // 释放 token
    } else {
      // 获取 token 失败，可能被 Task_High 占用
      
    }
    osDelay(20);
  }
  /* USER CODE END App_Task_Low */
}

/* USER CODE BEGIN Header_App_Task_High */
/**
* @brief Function implementing the Task_High thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_App_Task_High */
void App_Task_High(void *argument)
{
  /* USER CODE BEGIN App_Task_High */
  /* Infinite loop */
  for(;;)
  {
    if(xSemaphoreTake(tokenHandle,portMAX_DELAY) == pdTRUE){
      printf("HIGH TAKE IT!\r\n");
      HAL_Delay(10);
      xSemaphoreGive(tokenHandle);
    }
    osDelay(1);
  }
  /* USER CODE END App_Task_High */
}

/* Private application code --------------------------------------------------*/
/* USER CODE BEGIN Application */
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc){
  if(hadc->Instance == ADC1){
    adc_value = HAL_ADC_GetValue(hadc);
    //printf("ADC Conversion Completed!\r\n");
    BaseType_t highter_priority_task_woken = pdFALSE;
    if(BinarySem_DataReadyHandle != NULL){// 确保信号量已创建
      // 释放信号量，通知显示任务数据已准备好
      xSemaphoreGiveFromISR(BinarySem_DataReadyHandle, &highter_priority_task_woken);
      portYIELD_FROM_ISR(highter_priority_task_woken);
    }
    

  }
}

void HAL_RTCEx_WakeUpTimerEventCallback(RTC_HandleTypeDef *hrtc){
  // 这里可以添加定时器事件处理代码
  //释放计数信号量
  if(CountingSem_TableHandle != NULL){ // 确保信号量已创建
    BaseType_t highter_priority_task_woken = pdFALSE;
    xSemaphoreGiveFromISR(CountingSem_TableHandle, &highter_priority_task_woken);
    portYIELD_FROM_ISR(highter_priority_task_woken);
  }
}
/* USER CODE END Application */

